[{"name":"Star Wars: The Last Jedi","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7371.jpg","imdb":"tt2527336","genre":"Action, Adventure, Fantasy","year":"2017","min":"152 min","rating":"7.5","actors":"Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley","desc":"Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares for battle with the First Order."},{"name":"Black Panther","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7758.jpg","imdb":"tt1825683","genre":"Action, Adventure, Sci-Fi","year":"2018","min":"134 min","rating":"7.8","actors":"Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira","desc":"T'Challa, the King of Wakanda, rises to the throne in the isolated, technologically advanced African nation, but his claim is challenged by a vengeful outsider who was a childhood victim of T'Challa's father's mistake."},{"name":"Pacific Rim: Uprising","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7849.jpg","imdb":"tt2557478","genre":"Action, Adventure, Sci-Fi","year":"2018","min":"111 min","rating":"5.9","actors":"John Boyega, Scott Eastwood, Cailee Spaeny, Burn Gorman","desc":"Jake Pentecost, son of Stacker Pentecost, reunites with Mako Mori to lead a new generation of Jaeger pilots, including rival Lambert and 15-year-old hacker Amara, against a new Kaiju threat."},{"name":"Spider-Man: Homecoming","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-6890.jpg","imdb":"tt2250912","genre":"Action, Adventure, Sci-Fi","year":"2017","min":"133 min","rating":"7.9","actors":"Tom Holland, Michael Keaton, Robert Downey Jr., Marisa Tomei","desc":"Peter Parker tries to balance his life as an ordinary high school student in Queens with his superhero alter-ego Spider-Man, and must confront a new menace prowling the skies of New York City."},{"name":"Thor: Ragnarok","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7117.jpg","imdb":"tt3501632","genre":"Action, Adventure, Comedy","year":"2017","min":"130 min","rating":"8.1","actors":"Chris Hemsworth, Tom Hiddleston, Cate Blanchett, Idris Elba","desc":"Imprisoned, the mighty Thor finds himself in a lethal gladiatorial contest against the Hulk, his former ally. Thor must fight for survival and race against time to prevent the all-powerful Hela from destroying his home and the Asgardian civilization."},{"name":"Tomb Raider","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7937.jpg","imdb":"tt1365519","genre":"Action, Adventure, Drama","year":"2018","min":"118 min","rating":"6.8","actors":"Alicia Vikander, Dominic West, Walton Goggins, Daniel Wu","desc":"Lara Croft, the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she discovers the island where her father disappeared."},{"name":"Despicable Me 3","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-6849.jpg","imdb":"tt3469046","genre":"Animation, Action, Adventure","year":"2017","min":"96 min","rating":"6.3","actors":"Steve Carell, Kristen Wiig, Trey Parker, Miranda Cosgrove","desc":"Gru meets his long-lost charming, cheerful, and more successful twin brother Dru who wants to team up with him for one last criminal heist."}]
